function [h,rh]=Bostick(f,rs,phase)
% =========================================================================
% Bostick反演
% 钟乙源
% 2017, 11
% 中南大学，地球科学与信息物理学院
% ==============================参数=======================================
% f表示频点
% rs表示视电阻率
% phase表示相位，单位为弧度，如果得到的相位曲线单位是角度，计算前要把角度换算成
% 弧度；
% 注：rs和phase必须同为行向量或同为列向量
% ==============================返回值=====================================
% h为换算之后的深度
% rh为深度对应的电阻率
% =========================================================================
mu=4e-7*pi;
w=2*pi*f;
h=sqrt(rs./(mu*w));
rh=rs.*(pi./(2*phase)-1);